---
type: DisciplineTypeId
namespace: Autodesk.Revit.DB
version: 2024
members: 8
tags: [revit-api, class]
---

# DisciplineTypeId

`Autodesk.Revit.DB.DisciplineTypeId` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Architecture | 2022 | `public static ForgeTypeId Architecture { get ; }` |
| Property | Common | 2022 | `public static ForgeTypeId Common { get ; }` |
| Property | Electrical | 2022 | `public static ForgeTypeId Electrical { get ; }` |
| Property | Energy | 2022 | `public static ForgeTypeId Energy { get ; }` |
| Property | Hvac | 2022 | `public static ForgeTypeId Hvac { get ; }` |
| Property | Infrastructure | 2022 | `public static ForgeTypeId Infrastructure { get ; }` |
| Property | Piping | 2022 | `public static ForgeTypeId Piping { get ; }` |
| Property | Structural | 2022 | `public static ForgeTypeId Structural { get ; }` |